#lang scheme/base

; 1) Векторы противоположно направлены?
; Векторы могут быть противоположно напрвленны в том случае, если синус угла между ними равен нулю (найдем через векторное произведение), косинус угла между ними меньше нуля (найдем косинус из скалярного произведения)

(define (opposite? x1 y1 z1 x2 y2 z2)
    (define (norm x y z)
        (sqrt (+ (* x x) (* y y) (* z z)))
    )
    (define (mul_dif a b c d)
        (= 0 (- (* a b) (* c d)))
    )
    (and
        (mul_dif y1 z2 z1 y2)
        (mul_dif z1 x2 x1 z2)
        (mul_dif x1 y2 y1 x2)
        (>
            0
            (/ 
                (+ (* x1 x2) (* y1 y2) (* z1 z2))
                (* (norm x1 y1 z1) (norm x2 y2 z2))
            )
        )
    )
)

(opposite? 1 1 1 2 2 2)
(opposite? 2 3 4 1 2 3)
(opposite? 1 0 1 -2 0 -2)
(opposite? 1 0 1 3 0 3)
(opposite? 14 0 0 -14 0 0)

; Фомин Сергей 428
